Обработки/Reports/_РасчетВознагражденияФонда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_РасчетВознагражденияФонда</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_РасчетВознагражденияФонда/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Расчет вознаграждения Фонда",
		"0.14",
		"",
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Фиксируем запуск процедуры
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя();
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	Макет = ПолучитьМакет("Макет"); 
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	ДокументРезультат.Очистить();

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	Запрос.УстановитьПараметр("ДатаНачала",  					ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",  				КонецДня(ЭтотОбъект.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Организация",   					ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ЮрФизЛицоОрганизации",   		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Организация, "ЮрФизЛицо"));
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("НастройкаРасчетаВознаграждения", ОбщегоНазначения.ПолучитьИменованныйОбъект("Вознаграждение_ХМ_ПН"));

	#Область Текст_Запроса
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Наименование КАК Наименование,
		|	СчетаДоверительногоУправления.Организация КАК Организация,
		|	СчетаДоверительногоУправления.Ссылка КАК СчетДоверительногоУправления,
		|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	СчетаДоверительногоУправления.КодСчета КАК КодСчета,
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения,
		|	СчетаДоверительногоУправления.ДатаРасторжения КАК ДатаРасторжения,
		|	СчетаДоверительногоУправления.Организация.ВалютаУчета КАК ВалютаУчета,
		|	&ДатаНачала КАК НачалоБазовогоПериода,
		|	&ДатаОкончания КАК КонецБазовогоПериода,
		|	ВЫБОР
		|		КОГДА &ДатаНачала >= СчетаДоверительногоУправления.ДатаЗаключения
		|			ТОГДА &ДатаНачала
		|		ИНАЧЕ СчетаДоверительногоУправления.ДатаЗаключения
		|	КОНЕЦ КАК НачалоПериодаНачисления,
		|	ВЫБОР
		|		КОГДА &ДатаОкончания < СчетаДоверительногоУправления.ДатаРасторжения
		|				ИЛИ СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА &ДатаОкончания
		|		ИНАЧЕ КОНЕЦПЕРИОДА(СчетаДоверительногоУправления.ДатаРасторжения, ДЕНЬ)
		|	КОНЕЦ КАК КонецПериодаНачисления
		|ПОМЕСТИТЬ _КлиентыДействующиеНаДатуРасчета
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.Организация = &Организация
		|	И (СчетаДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ СчетаДоверительногоУправления.ДатаРасторжения >= НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ))
		|	И СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления";
	
	Запрос.Выполнить();
		
	ДатаПоследнейСЧА = Справочники.НастройкиРегламентныхДействий.ПолучитьДатуПоследнегоРасчетаСЧАЗаПериод(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Период.ДатаНачала, ЭтотОбъект.Период.ДатаОкончания);
	Если Не ЗначениеЗаполнено(ДатаПоследнейСЧА) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось определить настройки формирования СЧА за выбранный период для счета ДУ " + СокрЛП(ЭтотОбъект.СчетДоверительногоУправления), ЭтотОбъект.СчетДоверительногоУправления);
		Возврат;
	КонецЕсли;
	
	// Договора еще могло не быть на начало периода, тогда используем последний рабочий день до даты начала периода
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.СчетДоверительногоУправления, "ДатаЗаключения") < НачалоДня(ЭтотОбъект.Период.ДатаНачала) Тогда	
		ДатаПоследнейСЧАДоНачалаПериода = Справочники.НастройкиРегламентныхДействий.ПолучитьДатуПредыдущегоРасчетаСЧА(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Период.ДатаНачала);
	Иначе
		ДатаПоследнейСЧАДоНачалаПериода = Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, НачалоДня(ЭтотОбъект.Период.ДатаНачала) - 1 , -1);
	КонецЕсли;

	РаботаСОтчетами.ПоместитьКомиссииПоСделкамЗаПериодВМенеджерВременныхТаблиц(Запрос, ЭтотОбъект.Организация, ЭтотОбъект.Период.ДатаНачала, ЭтотОбъект.Период.ДатаОкончания, Новый Структура("ДатаПоследнейСЧА, ДатаПоследнейСЧАДоНачалаПериода", ДатаПоследнейСЧА, ДатаПоследнейСЧАДоНачалаПериода), "_КлиентыДействующиеНаДатуРасчета", Истина);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КлиентыДействующиеНаДатуРасчета.Организация КАК Организация,
		|	_КлиентыДействующиеНаДатуРасчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _КлиентыДействующиеВБазовомПериоде
		|ИЗ
		|	_КлиентыДействующиеНаДатуРасчета КАК _КлиентыДействующиеНаДатуРасчета
		|ГДЕ
		|	_КлиентыДействующиеНаДатуРасчета.ДатаЗаключения <= _КлиентыДействующиеНаДатуРасчета.КонецБазовогоПериода
		|	И (_КлиентыДействующиеНаДатуРасчета.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ _КлиентыДействующиеНаДатуРасчета.ДатаРасторжения >= _КлиентыДействующиеНаДатуРасчета.НачалоБазовогоПериода)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КлиентыДействующиеВБазовомПериоде.Организация КАК Организация,
		|	_КлиентыДействующиеВБазовомПериоде.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	"""" КАК ШаблонРасшифровки,
		|	НастройкиРасчетаВознаграждения.ВалютаРасчета КАК ВалютаРасчета,
		|	СоставляющиеНастройкиРасчета.Периодичность КАК ПериодичностьРасчета,
		|	СоставляющиеНастройкиРасчета.БазаРасчета КАК БазаРасчета,
		|	СоставляющиеНастройкиРасчета.ПараметрыРасчета КАК ПараметрыБазыРасчета,
		|	СоставляющиеНастройкиРасчета.Представление КАК Представление
		|ПОМЕСТИТЬ _НастройкиРасчетаВознаграждения
		|ИЗ
		|	_КлиентыДействующиеВБазовомПериоде КАК _КлиентыДействующиеВБазовомПериоде
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиРасчета КАК НастройкиРасчетаВознаграждения
		|		ПО (НастройкиРасчетаВознаграждения.Ссылка = &НастройкаРасчетаВознаграждения)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиРасчета.Составляющие КАК СоставляющиеНастройкиРасчета
		|		ПО (СоставляющиеНастройкиРасчета.Ссылка = &НастройкаРасчетаВознаграждения)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_НастройкиРасчетаВознаграждения.Организация КАК Организация,
		|	_НастройкиРасчетаВознаграждения.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_НастройкиРасчетаВознаграждения.ШаблонРасшифровки КАК ШаблонРасшифровки
		|ПОМЕСТИТЬ _КлиентыСНастройкамиРасчета
		|ИЗ
		|	_НастройкиРасчетаВознаграждения КАК _НастройкиРасчетаВознаграждения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КлиентыДействующиеНаДатуРасчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	НАЧАЛОПЕРИОДА(МИНИМУМ(ВводыАктивов.Период), ДЕНЬ) КАК ДатаПервогоВвода
		|ПОМЕСТИТЬ _ПервыеВводыАктивов
		|ИЗ
		|	_КлиентыДействующиеНаДатуРасчета КАК _КлиентыДействующиеНаДатуРасчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _КлиентыСНастройкамиРасчета КАК _КлиентыСНастройкамиРасчета
		|		ПО (_КлиентыСНастройкамиРасчета.СчетДоверительногоУправления = _КлиентыДействующиеНаДатуРасчета.СчетДоверительногоУправления)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВводыВыводыАктивовВВалютеУчета КАК ВводыАктивов
		|		ПО (ВводыАктивов.Организация = _КлиентыДействующиеНаДатуРасчета.Организация)
		|			И (ВводыАктивов.СчетДоверительногоУправления = _КлиентыДействующиеНаДатуРасчета.СчетДоверительногоУправления)
		|			И (ВводыАктивов.НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход))
		|			И (ВводыАктивов.Период <= _КлиентыДействующиеНаДатуРасчета.КонецБазовогоПериода)
		|
		|СГРУППИРОВАТЬ ПО
		|	_КлиентыДействующиеНаДатуРасчета.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_КлиентыДействующиеНаДатуРасчета.Наименование КАК Наименование,
		|	_КлиентыДействующиеНаДатуРасчета.Организация КАК Организация,
		|	_КлиентыДействующиеНаДатуРасчета.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_КлиентыДействующиеНаДатуРасчета.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	_КлиентыДействующиеНаДатуРасчета.КодСчета КАК КодСчета,
		|	_КлиентыДействующиеНаДатуРасчета.НомерДоговора КАК НомерДоговора,
		|	_КлиентыДействующиеНаДатуРасчета.ДатаЗаключения КАК ДатаЗаключения,
		|	_КлиентыДействующиеНаДатуРасчета.ДатаРасторжения КАК ДатаРасторжения,
		|	_КлиентыДействующиеНаДатуРасчета.ВалютаУчета КАК ВалютаУчета,
		|	_КлиентыДействующиеНаДатуРасчета.НачалоБазовогоПериода КАК НачалоБазовогоПериода,
		|	_КлиентыДействующиеНаДатуРасчета.КонецБазовогоПериода КАК КонецБазовогоПериода,
		|	_КлиентыДействующиеНаДатуРасчета.НачалоПериодаНачисления КАК НачалоПериодаНачисления,
		|	_КлиентыДействующиеНаДатуРасчета.КонецПериодаНачисления КАК КонецПериодаНачисления,
		|	_КлиентыСНастройкамиРасчета.ШаблонРасшифровки КАК ШаблонРасшифровки,
		|	КлиентыДУ.Клиент КАК Клиент,
		|	_КлиентыДействующиеНаДатуРасчета.ДатаЗаключения < НАЧАЛОПЕРИОДА(_КлиентыДействующиеНаДатуРасчета.НачалоБазовогоПериода, ГОД) КАК ДоговорЗаключенДоТекущегоГода,
		|	ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(_КлиентыДействующиеНаДатуРасчета.НачалоБазовогоПериода, ГОД), СЕКУНДА, -1) КАК КонецПредыдущегоГода,
		|	НАЧАЛОПЕРИОДА(_КлиентыДействующиеНаДатуРасчета.НачалоБазовогоПериода, ГОД) КАК НачалоГода,
		|	ДЕНЬГОДА(КОНЕЦПЕРИОДА(_КлиентыДействующиеНаДатуРасчета.НачалоБазовогоПериода, ГОД)) КАК ДнейВГоду,
		|	_ПервыеВводыАктивов.ДатаПервогоВвода КАК ДатаПервогоВвода
		|ПОМЕСТИТЬ _Клиенты
		|ИЗ
		|	_КлиентыДействующиеНаДатуРасчета КАК _КлиентыДействующиеНаДатуРасчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _КлиентыСНастройкамиРасчета КАК _КлиентыСНастройкамиРасчета
		|		ПО (_КлиентыСНастройкамиРасчета.СчетДоверительногоУправления = _КлиентыДействующиеНаДатуРасчета.СчетДоверительногоУправления)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ПервыеВводыАктивов КАК _ПервыеВводыАктивов
		|		ПО (_ПервыеВводыАктивов.СчетДоверительногоУправления = _КлиентыДействующиеНаДатуРасчета.СчетДоверительногоУправления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|				&ДатаОкончания,
		|				СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_КлиентыСНастройкамиРасчета.СчетДоверительногоУправления
		|					ИЗ
		|						_КлиентыСНастройкамиРасчета)) КАК КлиентыДУ
		|		ПО _КлиентыДействующиеНаДатуРасчета.СчетДоверительногоУправления = КлиентыДУ.СчетДоверительногоУправления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	_КлиентыДействующиеНаДатуРасчета.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствамОбороты.СуммаПриход КАК СуммаПриход,
		|	ЗадолженностиПоДенежнымСредствамОбороты.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _НеобходимыеРасходыУК_Развернуто
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|				И НЕ Аванс
		|				И (ВидЗадолженности В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.Комиссия))
		|						И НЕ ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии))
		|					ИЛИ ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПрочимУслугам), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НеобходимыеРасходыУправляющего), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НеобходимыеРасходыУправляющего), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВозмещениюСтраховыхПремий), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоПрочимДоходамИРасходам)))) КАК ЗадолженностиПоДенежнымСредствамОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СУММА(_КомиссииПоСделкам.Сумма),
		|	_КомиссииПоСделкам.СчетДоверительногоУправления
		|ИЗ
		|	_КомиссииПоСделкам КАК _КомиссииПоСделкам
		|
		|СГРУППИРОВАТЬ ПО
		|	_КомиссииПоСделкам.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(_НеобходимыеРасходыУК_Развернуто.СуммаПриход) КАК СуммаПриход,
		|	_НеобходимыеРасходыУК_Развернуто.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|ПОМЕСТИТЬ _НеобходимыеРасходыУК
		|ИЗ
		|	_НеобходимыеРасходыУК_Развернуто КАК _НеобходимыеРасходыУК_Развернуто
		|
		|СГРУППИРОВАТЬ ПО
		|	_НеобходимыеРасходыУК_Развернуто.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_НастройкиРасчетаВознаграждения.БазаРасчета КАК БазаРасчета
		|ИЗ
		|	_НастройкиРасчетаВознаграждения КАК _НастройкиРасчетаВознаграждения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Клиенты.Наименование КАК Наименование,
		|	_Клиенты.Организация КАК Организация,
		|	_Клиенты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_Клиенты.КодСчета КАК КодСчета,
		|	_Клиенты.НомерДоговора КАК НомерДоговора,
		|	_Клиенты.ДатаЗаключения КАК ДатаЗаключения,
		|	_Клиенты.ДатаРасторжения КАК ДатаРасторжения,
		|	_Клиенты.ВалютаУчета КАК ВалютаУчета,
		|	_Клиенты.НачалоБазовогоПериода КАК НачалоБазовогоПериода,
		|	_Клиенты.КонецБазовогоПериода КАК КонецБазовогоПериода,
		|	_Клиенты.ДнейВГоду КАК ДнейВГоду,
		|	_Клиенты.ШаблонРасшифровки КАК ШаблонРасшифровки,
		|	ЛОЖЬ КАК ОшибкаРасчета,
		|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 2)) КАК СуммаВознаграждения,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА(256)) КАК Описание,
		|	ВЫРАЗИТЬ("""" КАК СТРОКА) КАК РасшифровкаОшибки,
		|	ЕСТЬNULL(РеквизитыЮрЛицаКлиентаАнкетные.КраткоеНаименованиеПоУставу, РеквизитыФизЛицаКлиентаАнкетные.Фамилия + "" "" + РеквизитыФизЛицаКлиентаАнкетные.Имя + "" "" + РеквизитыФизЛицаКлиентаАнкетные.Отчество) КАК НаименованиеФонда,
		|	ЕСТЬNULL(_НеобходимыеРасходыУК.СуммаПриход, 0) КАК НеобходимыеРасходыУК,
		|	РеквизитыОрганизацииАнкетные.КраткоеНаименованиеПоУставу КАК НаименованиеУК
		|ИЗ
		|	_Клиенты КАК _Клиенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&ДатаОкончания,
		|				(Организация, ЮрФизЛицо, Язык) В
		|					(ВЫБРАТЬ
		|						_Клиенты.Организация,
		|						_Клиенты.Клиент,
		|						ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					ИЗ
		|						_Клиенты)) КАК РеквизитыЮрЛицаКлиентаАнкетные
		|		ПО (РеквизитыЮрЛицаКлиентаАнкетные.ЮрФизЛицо = _Клиенты.Клиент)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|				&ДатаОкончания,
		|				(Организация, ЮрФизЛицо, Язык) В
		|					(ВЫБРАТЬ
		|						_Клиенты.Организация,
		|						_Клиенты.Клиент,
		|						ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					ИЗ
		|						_Клиенты)) КАК РеквизитыФизЛицаКлиентаАнкетные
		|		ПО (РеквизитыФизЛицаКлиентаАнкетные.ЮрФизЛицо = _Клиенты.Клиент)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НеобходимыеРасходыУК КАК _НеобходимыеРасходыУК
		|		ПО _Клиенты.СчетДоверительногоУправления = _НеобходимыеРасходыУК.СчетДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&ДатаОкончания,
		|				(Организация, ЮрФизЛицо, Язык) В
		|					(ВЫБРАТЬ
		|						&Организация,
		|						&ЮрФизЛицоОрганизации,
		|						ЗНАЧЕНИЕ(Справочник.Языки.Русский))) КАК РеквизитыОрганизацииАнкетные
		|		ПО _Клиенты.Организация = РеквизитыОрганизацииАнкетные.Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	_Клиенты.Наименование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Клиенты.Наименование КАК Наименование,
		|	_Клиенты.Организация КАК Организация,
		|	_Клиенты.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_Клиенты.ВидДоговораДоверительногоУправления КАК ВидДоговораДоверительногоУправления,
		|	_Клиенты.КодСчета КАК КодСчета,
		|	_Клиенты.НомерДоговора КАК НомерДоговора,
		|	_Клиенты.ДатаЗаключения КАК ДатаЗаключения,
		|	_Клиенты.ДатаРасторжения КАК ДатаРасторжения,
		|	_Клиенты.ВалютаУчета КАК ВалютаУчета,
		|	_Клиенты.НачалоБазовогоПериода КАК НачалоБазовогоПериода,
		|	_Клиенты.КонецБазовогоПериода КАК КонецБазовогоПериода,
		|	_Клиенты.НачалоБазовогоПериода КАК НачалоРасчетногоПериода,
		|	_Клиенты.КонецБазовогоПериода КАК КонецРасчетногоПериода,
		|	_Клиенты.НачалоПериодаНачисления КАК НачалоПериодаНачисления,
		|	_Клиенты.КонецПериодаНачисления КАК КонецПериодаНачисления,
		|	_Клиенты.ШаблонРасшифровки КАК ШаблонРасшифровки,
		|	_Клиенты.Клиент КАК Клиент,
		|	_Клиенты.КонецПредыдущегоГода КАК КонецПредыдущегоГода,
		|	_Клиенты.НачалоГода КАК НачалоГода,
		|	_Клиенты.ДнейВГоду КАК ДнейВГоду,
		|	_Клиенты.ДатаПервогоВвода КАК ДатаПервогоВвода,
		|	ИСТИНА КАК ДоговорЗаключенДоТекущегоГода,
		|	_НастройкиРасчетаВознаграждения.ВалютаРасчета КАК ВалютаРасчета,
		|	_НастройкиРасчетаВознаграждения.ПериодичностьРасчета КАК ПериодичностьРасчета,
		|	_НастройкиРасчетаВознаграждения.БазаРасчета КАК БазаРасчета,
		|	_НастройкиРасчетаВознаграждения.ПараметрыБазыРасчета КАК ПараметрыБазыРасчета,
		|	_НастройкиРасчетаВознаграждения.Представление КАК Представление,
		|	РАЗНОСТЬДАТ(&ДатаНачала, &ДатаОкончания, ДЕНЬ) КАК КоличествоДнейПериодаРасчета,
		|	0 КАК ВознаграждениеУплаченноеСНачалаГода
		|ИЗ
		|	_Клиенты КАК _Клиенты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НастройкиРасчетаВознаграждения КАК _НастройкиРасчетаВознаграждения
		|		ПО (_НастройкиРасчетаВознаграждения.СчетДоверительногоУправления = _Клиенты.СчетДоверительногоУправления)";
		
	#КонецОбласти
			
	РезультатПакета = Запрос.ВыполнитьПакет();	
	
	БазыРасчета						= РезультатПакета[РезультатПакета.ВГраница() - 2].Выгрузить();
	Клиенты							= РезультатПакета[РезультатПакета.ВГраница() - 1].Выгрузить();
	НастройкиРасчетаВознаграждения	= РезультатПакета[РезультатПакета.ВГраница()].Выгрузить();
		
	Клиенты.Индексы.Добавить("СчетДоверительногоУправления");
	НастройкиРасчетаВознаграждения.Индексы.Добавить("БазаРасчета");
	
	Если БазыРасчета.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдена база для расчета вознаграждения");
		Возврат;
	КонецЕсли;
	
	Если Клиенты.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдены данные по счету доверительного управления");
		Возврат;
	КонецЕсли;
	
	ТекущаяБазаРасчета = БазыРасчета[0];
		
	ДанныеДляРасчета = НастройкиРасчетаВознаграждения.Скопировать(
		Новый Структура("БазаРасчета", ТекущаяБазаРасчета.БазаРасчета));
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("Организация",				ЭтотОбъект.Организация);
	ПараметрыРасчета.Вставить("ДатаРасчета",				ЭтотОбъект.Период.ДатаОкончания);
	ПараметрыРасчета.Вставить("БазаРасчета",				ТекущаяБазаРасчета.БазаРасчета);
	ПараметрыРасчета.Вставить("ДанныеДляРасчета",			ДанныеДляРасчета);
	ПараметрыРасчета.Вставить("РассчитанноеВознаграждение",	Неопределено); // для расчета ВУК по средней СЧА не требуется
	
	ВознаграждениеПоБазеРасчета = Справочники.БазыРасчета.РассчитатьВознаграждениеПоБазеРасчета(ПараметрыРасчета);
	
	Если ВознаграждениеПоБазеРасчета.Результат.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не рассчитано вознаграждение по настройкам");
		Возврат;
	КонецЕсли;

	Расчет = ВознаграждениеПоБазеРасчета.Результат[0];
	Если Расчет.СуммаВознаграждения = NULL Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не рассчитано вознаграждение: вероятно, СЧА рассчитано не за все дни выбранного периода");
		Возврат;
	КонецЕсли;
	
	СтрокаКлиента = Клиенты[0];
	ОбластьШапка.Параметры.Заполнить(СтрокаКлиента);
	ОбластьШапка.Параметры.Заполнить(Расчет);	
	
	ОбластьШапка.Параметры.КоличествоРабочихДнейВГоду 	= Расчет.ДнейВГоду;
	ОбластьШапка.Параметры.СуммаВознаграждения 			= Расчет.СуммаВознаграждения - СтрокаКлиента.НеобходимыеРасходыУК;
	Областьшапка.Параметры.ДатаЗаключения 				= Формат(СтрокаКлиента.ДатаЗаключения, "ДЛФ=DD");
	Областьшапка.Параметры.ДатаОтчета 					= Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=dd.MM.yyyy");
	Областьшапка.Параметры.ПериодОтчета 				= "с " + Формат(ЭтотОбъект.Период.ДатаНачала, "ДФ=dd.MM.yyyy") + " по " + Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=dd.MM.yyyy");	
	Областьшапка.Параметры.ПериодМесяц 					= Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ='MMMM yyyy'");

	Если ТипЗнч(ЭтотОбъект.Подписант) = Тип("Структура") И ЭтотОбъект.Подписант.Свойство("КонтактноеЛицо") Тогда
		ОбластьШапка.Параметры.Подписант = ЭтотОбъект.Подписант.КонтактноеЛицо;	
	КонецЕсли;
	
	ДокументРезультат.Вывести(ОбластьШапка);
	
	// Фиксируем завершение процедуры
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);	
	
КонецПроцедуры
